#### Terraform Plan Output
   ```
   data.terraform_remote_state.fabric: Reading...
data.terraform_remote_state.fabric: Read complete after 1s
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_D"]: Refreshing state... [id=X4IdimhKY7DQghUVHLw]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"]: Refreshing state... [id=kfzn0ghYw4qBg58oUEY]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"]: Refreshing state... [id=PqOzEbLBccaXOBn-Yp0]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"]: Refreshing state... [id=cw69bBBZx81vVSHSpvs]
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_A"]: Reading...
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_B"]: Reading...
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_C"]: Reading...
module.vpn_routing.data.apstra_blueprint_deployment.dc_1: Reading...
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_A"]: Read complete after 0s [name=Vendor_A]
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_B"]: Read complete after 0s [name=Vendor_B]
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_C"]: Read complete after 0s [name=Vendor_C]
module.vpn_routing.data.apstra_datacenter_ct_bgp_peering_ip_endpoint.vpn: Reading...
module.vpn_routing.data.apstra_datacenter_ct_bgp_peering_ip_endpoint.vpn: Read complete after 0s [name=BGP peering with VPN router]
module.vpn_routing.data.apstra_datacenter_ct_ip_link.vpn: Reading...
module.vpn_routing.data.apstra_datacenter_ct_ip_link.vpn: Read complete after 0s [name=IP handoff to VPN router]
module.vpn_routing.apstra_datacenter_connectivity_template.vpn: Refreshing state... [id=5a3380c0-45a6-11ee-b94d-617073747261]
module.vpn_routing.data.apstra_blueprint_deployment.dc_1: Read complete after 1s
null_resource.force_redeploy: Refreshing state... [id=8553055360090776966]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # apstra_blueprint_deployment.dc_1 will be created
  + resource "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "61154ae0-8d2c-4f12-a93f-8c9511847708"
      + comment                 = "$COMMENT Terraform {{.TerraformVersion}}, provider {{.ProviderVersion}}"
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # null_resource.force_redeploy must be replaced
-/+ resource "null_resource" "force_redeploy" {
      ~ id       = "8553055360090776966" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "fabric_staging_revision" = "27" -> "29"
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   